In [2]:
import pandas as pd
import numpy as np

In [18]:
df_clean = pd.DataFrame({'A':[1,2,np.nan],
                    'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df_clean

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df_clean.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [5]:
df_clean.isna()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [6]:
df_clean.isnull().sum()

A    1
B    2
C    0
dtype: int64

In [9]:
df_clean.dropna(inplace=True)

In [21]:
df_clean.fillna(df_clean.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [22]:
df_clean['B'].fillna(0)

0    5.0
1    0.0
2    0.0
Name: B, dtype: float64

In [23]:
df_clean

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [24]:
df_clean.replace(1, 'One')

     A    B    C
0  One  5.0  One
1  2.0  NaN    2
2  NaN  NaN    3

In [ ]:
df_clean['A'].astype(int)

In [25]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df_group = pd.DataFrame(data)
df_group

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [29]:
df_group.sort_values(by='Sales',ascending=False ,inplace=True)
df_group

  Company   Person  Sales
5      FB    Sarah    350
2    MSFT      Amy    340
4      FB     Carl    243
0    GOOG      Sam    200
3    MSFT  Vanessa    124
1    GOOG  Charlie    120

In [31]:
df_group.sort_index(ascending=False)

  Company   Person  Sales
5      FB    Sarah    350
4      FB     Carl    243
3    MSFT  Vanessa    124
2    MSFT      Amy    340
1    GOOG  Charlie    120
0    GOOG      Sam    200

In [34]:
df_group.groupby('Company').sum()

             Person  Sales
Company
FB        SarahCarl    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [35]:
df_group.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [36]:
df_group.pivot_table(index='Person',columns='Company',values='Sales')

Company     FB   GOOG   MSFT
Person
Amy        NaN    NaN  340.0
Carl     243.0    NaN    NaN
Charlie    NaN  120.0    NaN
Sam        NaN  200.0    NaN
Sarah    350.0    NaN    NaN
Vanessa    NaN    NaN  124.0

In [37]:
df_group.pivot_table(columns='Company', aggfunc=max)

C:\Users\Amr Ahmed\AppData\Local\Temp\ipykernel_6728\16267139.py:1: FutureWarning: The provided callable <built-in function max> is currently using DataFrameGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass 'max' instead.
  df_group.pivot_table(columns='Company', aggfunc=max)

Company     FB GOOG     MSFT
Person   Sarah  Sam  Vanessa
Sales      350  200      340

In [38]:
df_group

  Company   Person  Sales
5      FB    Sarah    350
2    MSFT      Amy    340
4      FB     Carl    243
0    GOOG      Sam    200
3    MSFT  Vanessa    124
1    GOOG  Charlie    120

In [40]:
df_group['Sales'].mean()

229.5